module PhaseRelationship
  extend ActiveSupport::Concern

  # 三合
  # 半会はこのうちの二つ
  TRINE_IDS = {
    water: [9, 1, 5],
    wood: [8, 4, 12],
    fire: [3, 7, 11],
    metal: [2, 6, 10]
  }

  # 支合
  COMBINATION_IDS = {
    north: [1, 2],
    east: [3, 12],
    west: [6, 9],
    south: [7, 8],
    Heavenly: [5, 10],
    center: [11, 4]
  }

  # 方三位
  # 準方三位はこのうち二つ
  DIRECTIONAL_IDS = {
    winter: [12, 1, 2],
    spring: [3, 4, 5],
    summer: [6, 7, 8],
    autumn: [9, 10, 11]
  }

  # 対冲
  CLASH_IDS = {
    heavenly: [[3, 9], [12, 6], [5, 11]],
    earthly: [[1, 7], [2, 8], [4, 10]]
  }

  # 害
  HARM_IDS = [[1, 8], [3, 6], [2, 7], [9, 12], [4, 5], [10, 11]]

  # 刑
  PUNISHMENT_IDS = {
    noble: [3, 6, 9],
    prosperous: [1, 4],
    hidden: [2, 8, 11],
    self_punishment: {
      noble: [12],
      prosperous: [7, 10],
      hidden: [5]
    }
  }

  # 破
  BRAKE_IDS = [[2, 5], [4, 7], [11, 8], [1, 10], [9, 6], [12, 3]]

  # 年運で利用する組み合わせ
  RELATIONSHIPS_HASH = {
    '子': {
      '子': nil,
      '丑': '支合',
      '寅': nil,
      '卯': '刑',
      '辰': '半会',
      '巳': nil,
      '午': '冲',
      '未': '害',
      '申': '半会',
      '酉': '破',
      '戌': nil,
      '亥': nil
    },
    '丑': {
      '子': '支合',
      '丑': nil,
      '寅': nil,
      '卯': nil,
      '辰': '破',
      '巳': '半会',
      '午': '害',
      '未': '冲刑',
      '申': nil,
      '酉': '半会',
      '戌': '刑',
      '亥': nil
    },
    '寅': {
      '子': nil,
      '丑': nil,
      '寅': nil,
      '卯': nil,
      '辰': nil,
      '巳': '害刑',
      '午': '半会',
      '未': nil,
      '申': '冲刑',
      '酉': nil,
      '戌': '半会',
      '亥': '支合破'
    },
    '卯': {
      '子': '刑',
      '丑': nil,
      '寅': nil,
      '卯': '同',
      '辰': '害',
      '巳': nil,
      '午': '破',
      '未': '半会',
      '申': nil,
      '酉': '冲',
      '戌': '支合',
      '亥': '半会'
    },
    '辰': {
      '子': '半会',
      '丑': '破',
      '寅': nil,
      '卯': '害',
      '辰': '自刑',
      '巳': nil,
      '午': nil,
      '未': nil,
      '申': '半会',
      '酉': '支合',
      '戌': '冲',
      '亥': nil
    },
    '巳': {
      '子': nil,
      '丑': '半会',
      '寅': '害刑',
      '卯': nil,
      '辰': nil,
      '巳': nil,
      '午': nil,
      '未': nil,
      '申': '合刑破',
      '酉': '半会',
      '戌': nil,
      '亥': '冲'
    },
    '午': {
      '子': '冲',
      '丑': '害',
      '寅': '半会',
      '卯': '破',
      '辰': nil,
      '巳': nil,
      '午': '自刑',
      '未': '支合',
      '申': nil,
      '酉': nil,
      '戌': '半会',
      '亥': nil
    },
    '未': {
      '子': '害',
      '丑': '冲刑',
      '寅': nil,
      '卯': '半会',
      '辰': nil,
      '巳': nil,
      '午': '支合',
      '未': nil,
      '申': nil,
      '酉': nil,
      '戌': '刑破',
      '亥': '半会'
    },
    '申': {
      '子': '半会',
      '丑': nil,
      '寅': '冲刑',
      '卯': nil,
      '辰': '半会',
      '巳': '合刑破',
      '午': nil,
      '未': nil,
      '申': nil,
      '酉': nil,
      '戌': nil,
      '亥': '害'
    },
    '酉': {
      '子': '破',
      '丑': '半会',
      '寅': nil,
      '卯': '冲',
      '辰': '支合',
      '巳': '半会',
      '午': nil,
      '未': nil,
      '申': nil,
      '酉': '自刑',
      '戌': '害',
      '亥': nil
    },
    '戌': {
      '子': nil,
      '丑': '刑',
      '寅': '半会',
      '卯': '支合',
      '辰': '冲',
      '巳': nil,
      '午': '半会',
      '未': '刑破',
      '申': nil,
      '酉': '害',
      '戌': nil,
      '亥': nil
    },
    '亥': {
      '子': nil,
      '丑': nil,
      '寅': '支合破',
      '卯': '半会',
      '辰': nil,
      '巳': '冲',
      '午': nil,
      '未': '半会',
      '申': '害',
      '酉': nil,
      '戌': nil,
      '亥': '自刑'
    }
  }
end
